In [216]:
import pandas as pd

In [217]:
proj = pd.read_csv('CSV_4.csv')

In [218]:
proj.head()

,ID,Candidate,Gender,credit card type,passion,Educational institution
0,1,Enoch Nayler,M,Bank of America,Hard Rock,Junior college
1,2,Ethan Terry,M,American Express,Blues,University-preparatory school
2,3,Ryan Newman,M,Maestro,Blues,University-preparatory school
3,4,Noemi Bradley,F,UnionPay,Dubstep,University-preparatory school
4,5,Rita Doherty,F,Capital One,Hard Rock,Gymnasium

In [219]:
proj.value_counts()

ID    Candidate       Gender  credit card type  passion    Educational institution
1     Enoch Nayler    M       Bank of America   Hard Rock  Junior college                   1
672   Carrie Eddison  F       Citibank          Hip-Hop    Junior college                   1
659   Callie Donovan  F       Discover          Pop        Graduate school                  1
660   Liam Miller     M       Discover          House      Technical college                1
661   Barry Clark     M       UnionPay          Opera      Corporate university             1
                                                                                           ..
339   Johnny Rees     M       Wells Fargo       Jazz       Gymnasium                        1
340   Gwen Wilkinson  F       Bank of America   Pop        Gymnasium                        1
341   Harry Wilson    M       Maestro           Country    University-preparatory school    1
342   Helen Widdows   F       Capital One       Pop        University college               1
1000  Agnes Wigley    F       Bank of America   House      Graduate school                  1
Length: 1000, dtype: int64

In [220]:
pd.isnull(proj)

,ID,Candidate,Gender,credit card type,passion,Educational institution
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
995,False,False,False,False,False,False
996,False,False,False,False,False,False
997,False,False,False,False,False,False
998,False,False,False,False,False,False
999,False,False,False,False,False,False

In [221]:
proj.isna().sum().sum()

0

In [222]:
proj.groupby(by='Candidate', as_index=False).agg({'ID': pd.Series.nunique})

           Candidate  ID
0      Abdul Cassidy   1
1         Abdul Dale   1
2         Ada Bailey   1
3         Ada Ulyatt   1
4          Ada Umney   1
..               ...  ..
993     William Swan   1
994   William Thomas   1
995   Willow Furnell   1
996     Willow Lynch   1
997  Willow Robinson   1

[998 rows x 2 columns]

In [223]:
proj['Gender'].unique()

array(['M', 'F'], dtype=object)

In [224]:
proj['credit card type'].unique()

array(['Bank of America', 'American Express', 'Maestro', 'UnionPay',
       'Capital One', 'Discover', 'Visa', 'Chase', 'Citibank',
       'Wells Fargo', 'MasterCard'], dtype=object)

In [225]:
proj['passion'].unique()

array(['Hard Rock', 'Blues', 'Dubstep', 'Soul', 'House', 'Pop', 'Latin',
       'Opera', 'Country', 'Reggae', 'Techno', 'Hip-Hop', 'Jazz',
       'Baroque', 'Drum & Bass'], dtype=object)

In [226]:
proj['Educational institution'].unique()

array(['Junior college', 'University-preparatory school', 'Gymnasium',
       'Public university', 'Graduate school', 'Technical college',
       'High school', 'Middle school', 'University college',
       'Corporate university'], dtype=object)

In [227]:
proj.rename(columns={'Educational institution': 'Educational_institution'}, inplace=True)

In [228]:
proj.rename(columns={'credit card type': 'credit_card_type'}, inplace=True)

In [229]:
proj.head()

,ID,Candidate,Gender,credit_card_type,passion,Educational_institution
0,1,Enoch Nayler,M,Bank of America,Hard Rock,Junior college
1,2,Ethan Terry,M,American Express,Blues,University-preparatory school
2,3,Ryan Newman,M,Maestro,Blues,University-preparatory school
3,4,Noemi Bradley,F,UnionPay,Dubstep,University-preparatory school
4,5,Rita Doherty,F,Capital One,Hard Rock,Gymnasium

In [261]:
# table sondage
#CrÃ©ation du dataframe correspondant Ã  la table sondage contenant les valeurs uniques de la colone 'Survey Year' du jeu de donnÃ©ees, en commerÃ§ant  l'index Ã  1 qui servira de l'ID dans la table , puis y intÃ©grer les donnÃ©es du dataframe 
Candidate = pd.DataFrame({'idU': proj['ID'],'Candidates': proj['Candidate'],'Gender': proj['Gender']})
Candidate.reset_index()
Candidate.head(3)

   idU    Candidates Gender
0    1  Enoch Nayler      M
1    2   Ethan Terry      M
2    3   Ryan Newman      M

In [262]:
Candidate.to_csv('candidate.csv')

In [297]:
credit_card_type = pd.DataFrame({'idh': proj['ID'],'credit_card_types': proj['credit_card_type']})
credit_card_type.reset_index()

     index   idh credit_card_types
0        0     1   Bank of America
1        1     2  American Express
2        2     3           Maestro
3        3     4          UnionPay
4        4     5       Capital One
..     ...   ...               ...
995    995   996       Wells Fargo
996    996   997          UnionPay
997    997   998  American Express
998    998   999          UnionPay
999    999  1000   Bank of America

[1000 rows x 3 columns]

In [299]:
credit_card_type = pd.read_csv('credit.csv', index_col=1)

In [300]:
credit_card_type

      Unnamed: 0  credit_card_type
idh
1              0   Bank of America
2              1  American Express
3              2           Maestro
4              3          UnionPay
5              4       Capital One
...          ...               ...
996          995       Wells Fargo
997          996          UnionPay
998          997  American Express
999          998          UnionPay
1000         999   Bank of America

[1000 rows x 2 columns]

In [293]:
credit_card_type.rename( columns={'credit_card_type':'credit_card_types'}, inplace=True )
credit_card_type.rename( columns={'Unnamed: 0':'idBank'}, inplace=True )
credit_card_type

      idBank credit_card_types
idh
1          0   Bank of America
2          1  American Express
3          2           Maestro
4          3          UnionPay
5          4       Capital One
...      ...               ...
996      995       Wells Fargo
997      996          UnionPay
998      997  American Express
999      998          UnionPay
1000     999   Bank of America

[1000 rows x 2 columns]

In [294]:
credit_card_type.to_csv('credit_card_type.csv')

In [295]:

#Bank_of_America =  proj[proj['credit_card_type']=='Bank of America']
# American_Express = proj[proj['credit_card_type']=='American Express']
# Maestro =  proj[proj['credit_card_type']=='Maestro']
# UnionPay = proj[proj['credit_card_type']=='UnionPay']
# Capital_One =  proj[proj['credit_card_type']=='Capital One']
# Discover = proj[proj['credit_card_type']=='Discover']
# Visa =  proj[proj['credit_card_type']=='Visa']
# Chase = proj[proj['credit_card_type']=='Chase']
# Citibank =  proj[proj['credit_card_type']=='Citibank']
# Wells_Fargo = proj[proj['credit_card_type']=='Wells Fargo']
# MasterCard =  proj[proj['credit_card_type']=='MasterCard']

#credit_card_type = pd.DataFrame({'credit_card_type': proj['credit_card_type'].unique()})
#credit_card_type.reset_index()

In [ ]:
passion = pd.DataFrame({'passions': proj['passion'],'idh': proj['ID']})
passion.reset_index()

In [301]:
passion.to_csv('passion.csv')

In [233]:
passion = pd.DataFrame({'passion': proj['passion'].unique()})
passion.reset_index()

    index      passion
0       0    Hard Rock
1       1        Blues
2       2      Dubstep
3       3         Soul
4       4        House
5       5          Pop
6       6        Latin
7       7        Opera
8       8      Country
9       9       Reggae
10     10       Techno
11     11      Hip-Hop
12     12         Jazz
13     13      Baroque
14     14  Drum & Bass

In [242]:
Educational_institution = pd.DataFrame({'Educational_institution': proj['Educational_institution'].unique()})
Educational_institution.reset_index(drop=False)

   index        Educational_institution
0      0                 Junior college
1      1  University-preparatory school
2      2                      Gymnasium
3      3              Public university
4      4                Graduate school
5      5              Technical college
6      6                    High school
7      7                  Middle school
8      8             University college
9      9           Corporate university